<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of VPN Tracker.</string>
	<key>Identifier</key>
	<string>com.github.KelleyComputing.download.VPNTracker</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VPN Tracker 365</string>
		<key>PRODUCT_URL</key>
		<string>https://www.vpntracker.com/us/download.html</string>
		<key>DOWNLOAD_BASE_URL</key>
		<string>https://www.vpntracker.com/download</string>
		<key>VERSION_RE_PATTERN</key>
		<string>VPN Tracker 365 ([\d.]+) Enterprise Installer.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>re_pattern</key>
                <string>%VERSION_RE_PATTERN%</string>
                <key>url</key>
                <string>%PRODUCT_URL%</string>
                <key>result_output_var_name</key>
                <string>VERSION</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%DOWNLOAD_BASE_URL%/VPN%20Tracker%20365%20%VERSION%%20Enterprise%20Installer.pkg</string>
				<key>filename</key>
				<string>VPN Tracker 365 %VERSION% Enterprise Installer.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
