<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of VPN Tracker.</string>
	<key>Identifier</key>
	<string>com.github.KelleyComputing.download.VPNTracker</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VPN Tracker 365</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.vpntracker.com/goto/HPdownload/VPNT365Latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
        <key>filename</key>
        <string>VPNTracker365.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
  		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
    <dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>  
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
