<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Open Asset for InDesign.</string>
	<key>Identifier</key>
	<string>com.github.KelleyComputing.download.OpenAssetForInDesign</string>
	<key>Input</key>
	<dict>
		<key>SRC_URL</key>
		<string>https://success.openasset.com/en/articles/3084032-openasset-indesign-plugin-installation</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%SRC_URL%</string>
				<key>re_pattern</key>
				<string>https://indesign-plugin-updates.openasset.com/releases/[0-9_]*?/OpenAssetForInDesign[0-9_]*?.pkg</string>
				<key>result_output_var_name</key>
				<string>DL_URL</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DL_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Axomic Ltd (C22D24A7M7)</string>
					<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
