<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Egnyte Desktop App Core for Mac.</string>
	<key>Identifier</key>
	<string>com.github.KelleyComputing.download.EgnyteCore</string>
	<key>Input</key>
	<dict>
        <key>DOWNLOAD_URL</key>
        <string>https://egnyte-cdn.egnyte.com/desktopapp/mac/en-us/latest/Egnyte.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
