<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of GoTo and imports it in to Munki. Use ARCH values `x86_64` or `arm64` to distinguish between versions. Add exclusion to munki to stop x86 version from installing on ARM if desired.</string>
	<key>Identifier</key>
	<string>com.github.KelleyComputing.munki.GoTo</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GoTo</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>LogMeIn, Inc.</string>
			<key>display_name</key>
			<string>GoTo</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>supported_architectures</key>
         		<array>
            		<string>%ARCH%</string>
         		</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.KelleyComputing.download.GoTo</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
