<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string></string>
	<key>Description</key>
	<string>Downloads the latest version of SketchUp.</string>
	<key>Identifier</key>
	<string>com.github.KelleyComputing.download.SketchUp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SketchUp</string>
		<key>MAJOR_RELEASE</key>
		<string>2024</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.sketchup.com/SketchUp-%MAJOR_RELEASE%-([\d.]+)-([\d.]+)-([\d.]+).dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
